#include <msp430G2553.h>

/******************************************************************************************************
 * 名    称：ADC初始化函数
 * 说    明：设置P1.5为输入口
 ******************************************************************************************************/
void ADC_Init()
{
	//打开2.5V内部参考电压，地位负参考
	  ADC10CTL0 |= REFON+REF2_5V+ADC10SHT_2 + ADC10ON + ADC10IE; // ADC10ON, interrupt enabled
	  ADC10CTL1 = INCH_5;                       // input A5
	  ADC10AE0 |= BIT5;                         // PA.1 ADC option select

}
/******************************************************************************************************
 * 名    称：ADC中断服务函数
 * 说    明：进入ADC中断——功能目前为空
 ******************************************************************************************************/
#pragma vector=ADC10_VECTOR
__interrupt void ADC10_ISR(void)
{
  //__bic_SR_register_on_exit(CPUOFF);        // Clear CPUOFF bit from 0(SR)
}
